---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.Visibility
source: html/3efddea0-63fb-8440-aead-904f2f393ff2.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.Visibility Property

Visibility of the handle and the associated DirectContext3D graphics.
 A value of true means that the graphics are visible.

## Syntax (C#)
```csharp
public bool Visibility { get; set; }
```